# Практическая работа №1
Ход работы : требуется написать следущие программы на языке программирования С. 


##### Программа №1
"Написать программу, печатающую в stdout фразу "Hello, World!" на отдельной строке."
##### Исходный код по первой программе 
```
#include <stdio.h>

int main()
{
	printf("Hello, World!");
	return 0;
} 
```

##### Программа №2. 
"Написать программу, принимающую на вход два числа, разделённые пробелом, и суммирующую их. Ввод чисел производить из stdin, вывод результата - в stdout. Вводимые числа не превосходят по модулю 2147483647."

#include <stdio.h>
```
int main()
double a, b;
	if (scanf("%lf%lf", &a, &b) > 0)
		printf("%lf", a + b);
	return 0;
}
```

##### Программа №3. 
"Написать программу, принимающую на вход числа x и y, разделённые пробелом, и вычисляющую x в степени y. Ввод чисел производить из stdin, вывод результата - в stdout. Вводимые числа не превосходят по модулю 2147483647. Реализовывать возведение в степень через цикл/рекурсию не допускается."
```
#include <stdio.h>
#include <math.h>

int main()
{
	double x, y;
	if (scanf("%lf%lf", &x, &y) > 0)
		printf("%lf", pow(x, y));
	return 0;
}
```

### Результат : все работы прекрасно работаю и прошли проверку. 

